una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe256.h
#define AT91C_PITC_PIVR ((AT91_REG *) 	0xFFFFFD38) /* (PITC) Period Interval Value Register*/
#define AT91C_PITC_PISR ((AT91_REG *) 	0xFFFFFD34) /* (PITC) Period Interval Status Register*/
#define AT91C_PITC_PIIR ((AT91_REG *) 	0xFFFFFD3C) /* (PITC) Period Interval Image Register*/
#define AT91C_PITC_PIMR ((AT91_REG *) 	0xFFFFFD30) /* (PITC) Period Interval Mode Register*/
/* ========== Register definition for WDTC peripheral ========== */
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0xFFFFFD40) /* (WDTC) Watchdog Control Register*/
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0xFFFFFD48) /* (WDTC) Watchdog Status Register*/
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0xFFFFFD44) /* (WDTC) Watchdog Mode Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) /* (TC0) Status Register*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) /* (TC0) Register C*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) /* (TC0) Register B*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) /* (TC0) Channel Control Register*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) /* (TC0) Register A*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) /* (TC0) Interrupt Disable Register*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) /* (TC0) Counter Value*/
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) /* (TC1) Register B*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFFA0040) /* (TC1) Channel Control Register*/
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFFA0064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFFA0068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFFA0060) /* (TC1) Status Register*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFFA0044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFFA0054) /* (TC1) Register A*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFFA005C) /* (TC1) Register C*/
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFFA006C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFFA0050) /* (TC1) Counter Value*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFFA0084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFFA0080) /* (TC2) Channel Control Register*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFFA0090) /* (TC2) Counter Value*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFFA0094) /* (TC2) Register A*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFFA0098) /* (TC2) Register B*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFFA00A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFFA00AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFFA009C) /* (TC2) Register C*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFFA00A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFFA00A0) /* (TC2) Status Register*/
/* ========== Register definition for TC3 peripheral ========== */
#define AT91C_TC3_IER   ((AT91_REG *) 	0xFFFDC024) /* (TC3) Interrupt Enable Register*/
#define AT91C_TC3_RB    ((AT91_REG *) 	0xFFFDC018) /* (TC3) Register B*/
#define AT91C_TC3_CMR   ((AT91_REG *) 	0xFFFDC004) /* (TC3) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC3_RC    ((AT91_REG *) 	0xFFFDC01C) /* (TC3) Register C*/
#define AT91C_TC3_CCR   ((AT91_REG *) 	0xFFFDC000) /* (TC3) Channel Control Register*/
#define AT91C_TC3_SR    ((AT91_REG *) 	0xFFFDC020) /* (TC3) Status Register*/
#define AT91C_TC3_CV    ((AT91_REG *) 	0xFFFDC010) /* (TC3) Counter Value*/
#define AT91C_TC3_RA    ((AT91_REG *) 	0xFFFDC014) /* (TC3) Register A*/
#define AT91C_TC3_IDR   ((AT91_REG *) 	0xFFFDC028) /* (TC3) Interrupt Disable Register*/
#define AT91C_TC3_IMR   ((AT91_REG *) 	0xFFFDC02C) /* (TC3) Interrupt Mask Register*/
/* ========== Register definition for TC4 peripheral ========== */
#define AT91C_TC4_CMR   ((AT91_REG *) 	0xFFFDC044) /* (TC4) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC4_RC    ((AT91_REG *) 	0xFFFDC05C) /* (TC4) Register C*/
#define AT91C_TC4_SR    ((AT91_REG *) 	0xFFFDC060) /* (TC4) Status Register*/
#define AT91C_TC4_RB    ((AT91_REG *) 	0xFFFDC058) /* (TC4) Register B*/
#define AT91C_TC4_IER   ((AT91_REG *) 	0xFFFDC064) /* (TC4) Interrupt Enable Register*/
#define AT91C_TC4_CV    ((AT91_REG *) 	0xFFFDC050) /* (TC4) Counter Value*/
#define AT91C_TC4_RA    ((AT91_REG *) 	0xFFFDC054) /* (TC4) Register A*/
#define AT91C_TC4_IDR   ((AT91_REG *) 	0xFFFDC068) /* (TC4) Interrupt Disable Register*/
#define AT91C_TC4_IMR   ((AT91_REG *) 	0xFFFDC06C) /* (TC4) Interrupt Mask Register*/
#define AT91C_TC4_CCR   ((AT91_REG *) 	0xFFFDC040) /* (TC4) Channel Control Register*/
/* ========== Register definition for TC5 peripheral ========== */
#define AT91C_TC5_RB    ((AT91_REG *) 	0xFFFDC098) /* (TC5) Register B*/
#define AT91C_TC5_RA    ((AT91_REG *) 	0xFFFDC094) /* (TC5) Register A*/
#define AT91C_TC5_CV    ((AT91_REG *) 	0xFFFDC090) /* (TC5) Counter Value*/
#define AT91C_TC5_CCR   ((AT91_REG *) 	0xFFFDC080) /* (TC5) Channel Control Register*/
#define AT91C_TC5_SR    ((AT91_REG *) 	0xFFFDC0A0) /* (TC5) Status Register*/
#define AT91C_TC5_IER   ((AT91_REG *) 	0xFFFDC0A4) /* (TC5) Interrupt Enable Register*/
#define AT91C_TC5_IDR   ((AT91_REG *) 	0xFFFDC0A8) /* (TC5) Interrupt Disable Register*/
#define AT91C_TC5_RC    ((AT91_REG *) 	0xFFFDC09C) /* (TC5) Register C*/
#define AT91C_TC5_IMR   ((AT91_REG *) 	0xFFFDC0AC) /* (TC5) Interrupt Mask Register*/
#define AT91C_TC5_CMR   ((AT91_REG *) 	0xFFFDC084) /* (TC5) Channel Mode Register (Capture Mode / Waveform Mode)*/
/* ========== Register definition for TCB0 peripheral ========== */
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0xFFFA00C4) /* (TCB0) TC Block Mode Register*/
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0xFFFA00C0) /* (TCB0) TC Block Control Register*/
/* ========== Register definition for TCB1 peripheral ========== */
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0xFFFDC0C0) /* (TCB1) TC Block Control Register*/
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0xFFFDC0C4) /* (TCB1) TC Block Mode Register*/
/* ========== Register definition for PDC_MCI peripheral ========== */
#define AT91C_MCI_RNCR  ((AT91_REG *) 	0xFFFA8114) /* (PDC_MCI) Receive Next Counter Register*/
#define AT91C_MCI_TCR   ((AT91_REG *) 	0xFFFA810C) /* (PDC_MCI) Transmit Counter Register*/
#define AT91C_MCI_RCR   ((AT91_REG *) 	0xFFFA8104) /* (PDC_MCI) Receive Counter Register*/
#define AT91C_MCI_TNPR  ((AT91_REG *) 	0xFFFA8118) /* (PDC_MCI) Transmit Next Pointer Register*/
#define AT91C_MCI_RNPR  ((AT91_REG *) 	0xFFFA8110) /* (PDC_MCI) Receive Next Pointer Register*/
#define AT91C_MCI_RPR   ((AT91_REG *) 	0xFFFA8100) /* (PDC_MCI) Receive Pointer Register*/
#define AT91C_MCI_TNCR  ((AT91_REG *) 	0xFFFA811C) /* (PDC_MCI) Transmit Next Counter Register*/
#define AT91C_MCI_TPR   ((AT91_REG *) 	0xFFFA8108) /* (PDC_MCI) Transmit Pointer Register*/
#define AT91C_MCI_PTSR  ((AT91_REG *) 	0xFFFA8124) /* (PDC_MCI) PDC Transfer Status Register*/
#define AT91C_MCI_PTCR  ((AT91_REG *) 	0xFFFA8120) /* (PDC_MCI) PDC Transfer Control Register*/
/* ========== Register definition for MCI peripheral ========== */
#define AT91C_MCI_RDR   ((AT91_REG *) 	0xFFFA8030) /* (MCI) MCI Receive Data Register*/
#define AT91C_MCI_CMDR  ((AT91_REG *) 	0xFFFA8014) /* (MCI) MCI Command Register*/
#define AT91C_MCI_VR    ((AT91_REG *) 	0xFFFA80FC) /* (MCI) MCI Version Register*/
#define AT91C_MCI_IDR   ((AT91_REG *) 	0xFFFA8048) /* (MCI) MCI Interrupt Disable Register*/
#define AT91C_MCI_DTOR  ((AT91_REG *) 	0xFFFA8008) /* (MCI) MCI Data Timeout Register*/
#define AT91C_MCI_TDR   ((AT91_REG *) 	0xFFFA8034) /* (MCI) MCI Transmit Data Register*/
#define AT91C_MCI_IER   ((AT91_REG *) 	0xFFFA8044) /* (MCI) MCI Interrupt Enable Register*/
#define AT91C_MCI_BLKR  ((AT91_REG *) 	0xFFFA8018) /* (MCI) MCI Block Register*/
#define AT91C_MCI_MR    ((AT91_REG *) 	0xFFFA8004) /* (MCI) MCI Mode Register*/
#define AT91C_MCI_IMR   ((AT91_REG *) 	0xFFFA804C) /* (MCI) MCI Interrupt Mask Register*/
#define AT91C_MCI_CR    ((AT91_REG *) 	0xFFFA8000) /* (MCI) MCI Control Register*/
#define AT91C_MCI_ARGR  ((AT91_REG *) 	0xFFFA8010) /* (MCI) MCI Argument Register*/
#define AT91C_MCI_SDCR  ((AT91_REG *) 	0xFFFA800C) /* (MCI) MCI SD Card Register*/
#define AT91C_MCI_SR    ((AT91_REG *) 	0xFFFA8040) /* (MCI) MCI Status Register*/
#define AT91C_MCI_RSPR  ((AT91_REG *) 	0xFFFA8020) /* (MCI) MCI Response Register*/
/* ========== Register definition for PDC_TWI0 peripheral ========== */
#define AT91C_TWI0_PTSR ((AT91_REG *) 	0xFFFAC124) /* (PDC_TWI0) PDC Transfer Status Register*/
#define AT91C_TWI0_RPR  ((AT91_REG *) 	0xFFFAC100) /* (PDC_TWI0) Receive Pointer Register*/
#define AT91C_TWI0_RNCR ((AT91_REG *) 	0xFFFAC114) /* (PDC_TWI0) Receive Next Counter Register*/
#define AT91C_TWI0_RCR  ((AT91_REG *) 	0xFFFAC104) /* (PDC_TWI0) Receive Counter Register*/
#define AT91C_TWI0_PTCR ((AT91_REG *) 	0xFFFAC120) /* (PDC_TWI0) PDC Transfer Control Register*/
#define AT91C_TWI0_TPR  ((AT91_REG *) 	0xFFFAC108) /* (PDC_TWI0) Transmit Pointer Register*/
#define AT91C_TWI0_RNPR ((AT91_REG *) 	0xFFFAC110) /* (PDC_TWI0) Receive Next Pointer Register*/
#define AT91C_TWI0_TNPR ((AT91_REG *) 	0xFFFAC118) /* (PDC_TWI0) Transmit Next Pointer Register*/
#define AT91C_TWI0_TCR  ((AT91_REG *) 	0xFFFAC10C) /* (PDC_TWI0) Transmit Counter Register*/
#define AT91C_TWI0_TNCR ((AT91_REG *) 	0xFFFAC11C) /* (PDC_TWI0) Transmit Next Counter Register*/
/* ========== Register definition for TWI0 peripheral ========== */
#define AT91C_TWI0_THR  ((AT91_REG *) 	0xFFFAC034) /* (TWI0) Transmit Holding Register*/
#define AT91C_TWI0_IDR  ((AT91_REG *) 	0xFFFAC028) /* (TWI0) Interrupt Disable Register*/
#define AT91C_TWI0_SMR  ((AT91_REG *) 	0xFFFAC008) /* (TWI0) Slave Mode Register*/
#define AT91C_TWI0_CWGR ((AT91_REG *) 	0xFFFAC010) /* (TWI0) Clock Waveform Generator Register*/
#define AT91C_TWI0_IADR ((AT91_REG *) 	0xFFFAC00C) /* (TWI0) Internal Address Register*/
#define AT91C_TWI0_RHR  ((AT91_REG *) 	0xFFFAC030) /* (TWI0) Receive Holding Register*/
#define AT91C_TWI0_IER  ((AT91_REG *) 	0xFFFAC024) /* (TWI0) Interrupt Enable Register*/
#define AT91C_TWI0_MMR  ((AT91_REG *) 	0xFFFAC004) /* (TWI0) Master Mode Register*/
#define AT91C_TWI0_SR   ((AT91_REG *) 	0xFFFAC020) /* (TWI0) Status Register*/
#define AT91C_TWI0_IMR  ((AT91_REG *) 	0xFFFAC02C) /* (TWI0) Interrupt Mask Register*/
#define AT91C_TWI0_CR   ((AT91_REG *) 	0xFFFAC000) /* (TWI0) Control Register*/
/* ========== Register definition for PDC_TWI1 peripheral ========== */
#define AT91C_TWI1_PTSR ((AT91_REG *) 	0xFFFD8124) /* (PDC_TWI1) PDC Transfer Status Register*/
#define AT91C_TWI1_PTCR ((AT91_REG *) 	0xFFFD8120) /* (PDC_TWI1) PDC Transfer Control Register*/
#define AT91C_TWI1_TNPR ((AT91_REG *) 	0xFFFD8118) /* (PDC_TWI1) Transmit Next Pointer Register*/
#define AT91C_TWI1_TNCR ((AT91_REG *) 	0xFFFD811C) /* (PDC_TWI1) Transmit Next Counter Register*/
#define AT91C_TWI1_RNPR ((AT91_REG *) 	0xFFFD8110) /* (PDC_TWI1) Receive Next Pointer Register*/
#define AT91C_TWI1_RNCR ((AT91_REG *) 	0xFFFD8114) /* (PDC_TWI1) Receive Next Counter Register*/
#define AT91C_TWI1_RPR  ((AT91_REG *) 	0xFFFD8100) /* (PDC_TWI1) Receive Pointer Register*/
#define AT91C_TWI1_TCR  ((AT91_REG *) 	0xFFFD810C) /* (PDC_TWI1) Transmit Counter Register*/
#define AT91C_TWI1_TPR  ((AT91_REG *) 	0xFFFD8108) /* (PDC_TWI1) Transmit Pointer Register*/
#define AT91C_TWI1_RCR  ((AT91_REG *) 	0xFFFD8104) /* (PDC_TWI1) Receive Counter Register*/
/* ========== Register definition for TWI1 peripheral ========== */
#define AT91C_TWI1_RHR  ((AT91_REG *) 	0xFFFD8030) /* (TWI1) Receive Holding Register*/
#define AT91C_TWI1_IER  ((AT91_REG *) 	0xFFFD8024) /* (TWI1) Interrupt Enable Register*/
#define AT91C_TWI1_CWGR ((AT91_REG *) 	0xFFFD8010) /* (TWI1) Clock Waveform Generator Register*/
#define AT91C_TWI1_MMR  ((AT91_REG *) 	0xFFFD8004) /* (TWI1) Master Mode Register*/
#define AT91C_TWI1_IADR ((AT91_REG *) 	0xFFFD800C) /* (TWI1) Internal Address Register*/
#define AT91C_TWI1_THR  ((AT91_REG *) 	0xFFFD8034) /* (TWI1) Transmit Holding Register*/
#define AT91C_TWI1_IMR  ((AT91_REG *) 	0xFFFD802C) /* (TWI1) Interrupt Mask Register*/
#define AT91C_TWI1_SR   ((AT91_REG *) 	0xFFFD8020) /* (TWI1) Status Register*/
#define AT91C_TWI1_IDR  ((AT91_REG *) 	0xFFFD8028) /* (TWI1) Interrupt Disable Register*/
#define AT91C_TWI1_CR   ((AT91_REG *) 	0xFFFD8000) /* (TWI1) Control Register*/
#define AT91C_TWI1_SMR  ((AT91_REG *) 	0xFFFD8008) /* (TWI1) Slave Mode Register*/
/* ========== Register definition for PDC_US0 peripheral ========== */
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFFB010C) /* (PDC_US0) Transmit Counter Register*/
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFFB0120) /* (PDC_US0) PDC Transfer Control Register*/
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFFB0114) /* (PDC_US0) Receive Next Counter Register*/
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFFB0124) /* (PDC_US0) PDC Transfer Status Register*/
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFFB011C) /* (PDC_US0) Transmit Next Counter Register*/
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFFB0110) /* (PDC_US0) Receive Next Pointer Register*/
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFFB0104) /* (PDC_US0) Receive Counter Register*/
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFFB0108) /* (PDC_US0) Transmit Pointer Register*/
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFFB0118) /* (PDC_US0) Transmit Next Pointer Register*/
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFFB0100) /* (PDC_US0) Receive Pointer Register*/
/* ========== Register definition for US0 peripheral ========== */
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFFB0018) /* (US0) Receiver Holding Register*/
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFFB0044) /* (US0) Nb Errors Register*/
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFFB0008) /* (US0) Interrupt Enable Register*/
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFFB0000) /* (US0) Control Register*/
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFFB001C) /* (US0) Transmitter Holding Register*/
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFFB0014) /* (US0) Channel Status Register*/
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFFB0020) /* (US0) Baud Rate Generator Register*/
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFFB0024) /* (US0) Receiver Time-out Register*/
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFFB0028) /* (US0) Transmitter Time-guard Register*/
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFFB000C) /* (US0) Interrupt Disable Register*/
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFFB0004) /* (US0) Mode Register*/
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFFB004C) /* (US0) IRDA_FILTER Register*/
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFFB0040) /* (US0) FI_DI_Ratio Register*/
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFFB0010) /* (US0) Interrupt Mask Register*/
/* ========== Register definition for PDC_US1 peripheral ========== */
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFFB4120) /* (PDC_US1) PDC Transfer Control Register*/
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFFB4104) /* (PDC_US1) Receive Counter Register*/
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFFB4100) /* (PDC_US1) Receive Pointer Register*/
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFFB4124) /* (PDC_US1) PDC Transfer Status Register*/
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFFB4108) /* (PDC_US1) Transmit Pointer Register*/
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFFB410C) /* (PDC_US1) Transmit Counter Register*/
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFFB4110) /* (PDC_US1) Receive Next Pointer Register*/
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFFB411C) /* (PDC_US1) Transmit Next Counter Register*/
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFFB4114) /* (PDC_US1) Receive Next Counter Register*/
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFFB4118) /* (PDC_US1) Transmit Next Pointer Register*/
/* ========== Register definition for US1 peripheral ========== */
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFFB401C) /* (US1) Transmitter Holding Register*/
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFFB4028) /* (US1) Transmitter Time-guard Register*/
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFFB4020) /* (US1) Baud Rate Generator Register*/
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFFB400C) /* (US1) Interrupt Disable Register*/
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFFB4004) /* (US1) Mode Register*/
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFFB4024) /* (US1) Receiver Time-out Register*/
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFFB4000) /* (US1) Control Register*/
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFFB4010) /* (US1) Interrupt Mask Register*/
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFFB4040) /* (US1) FI_DI_Ratio Register*/
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFFB4018) /* (US1) Receiver Holding Register*/
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFFB4008) /* (US1) Interrupt Enable Register*/
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFFB4014) /* (US1) Channel Status Register*/
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFFB404C) /* (US1) IRDA_FILTER Register*/
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFFB4044) /* (US1) Nb Errors Register*/
/* ========== Register definition for PDC_US2 peripheral ========== */
#define AT91C_US2_TNCR  ((AT91_REG *) 	0xFFFB811C) /* (PDC_US2) Transmit Next Counter Register*/
#define AT91C_US2_RNCR  ((AT91_REG *) 	0xFFFB8114) /* (PDC_US2) Receive Next Counter Register*/
#define AT91C_US2_TNPR  ((AT91_REG *) 	0xFFFB8118) /* (PDC_US2) Transmit Next Pointer Register*/
#define AT91C_US2_PTCR  ((AT91_REG *) 	0xFFFB8120) /* (PDC_US2) PDC Transfer Control Register*/
#define AT91C_US2_TCR   ((AT91_REG *) 	0xFFFB810C) /* (PDC_US2) Transmit Counter Register*/
#define AT91C_US2_RPR   ((AT91_REG *) 	0xFFFB8100) /* (PDC_US2) Receive Pointer Register*/
#define AT91C_US2_TPR   ((AT91_REG *) 	0xFFFB8108) /* (PDC_US2) Transmit Pointer Register*/
#define AT91C_US2_RCR   ((AT91_REG *) 	0xFFFB8104) /* (PDC_US2) Receive Counter Register*/
#define AT91C_US2_PTSR  ((AT91_REG *) 	0xFFFB8124) /* (PDC_US2) PDC Transfer Status Register*/
#define AT91C_US2_RNPR  ((AT91_REG *) 	0xFFFB8110) /* (PDC_US2) Receive Next Pointer Register*/
/* ========== Register definition for US2 peripheral ========== */
#define AT91C_US2_RTOR  ((AT91_REG *) 	0xFFFB8024) /* (US2) Receiver Time-out Register*/
#define AT91C_US2_CSR   ((AT91_REG *) 	0xFFFB8014) /* (US2) Channel Status Register*/
#define AT91C_US2_CR    ((AT91_REG *) 	0xFFFB8000) /* (US2) Control Register*/
#define AT91C_US2_BRGR  ((AT91_REG *) 	0xFFFB8020) /* (US2) Baud Rate Generator Register*/
#define AT91C_US2_NER   ((AT91_REG *) 	0xFFFB8044) /* (US2) Nb Errors Register*/
#define AT91C_US2_FIDI  ((AT91_REG *) 	0xFFFB8040) /* (US2) FI_DI_Ratio Register*/
#define AT91C_US2_TTGR  ((AT91_REG *) 	0xFFFB8028) /* (US2) Transmitter Time-guard Register*/
#define AT91C_US2_RHR   ((AT91_REG *) 	0xFFFB8018) /* (US2) Receiver Holding Register*/
#define AT91C_US2_IDR   ((AT91_REG *) 	0xFFFB800C) /* (US2) Interrupt Disable Register*/
#define AT91C_US2_THR   ((AT91_REG *) 	0xFFFB801C) /* (US2) Transmitter Holding Register*/
#define AT91C_US2_MR    ((AT91_REG *) 	0xFFFB8004) /* (US2) Mode Register*/
#define AT91C_US2_IMR   ((AT91_REG *) 	0xFFFB8010) /* (US2) Interrupt Mask Register*/
#define AT91C_US2_IF    ((AT91_REG *) 	0xFFFB804C) /* (US2) IRDA_FILTER Register*/
#define AT91C_US2_IER   ((AT91_REG *) 	0xFFFB8008) /* (US2) Interrupt Enable Register*/
/* ========== Register definition for PDC_US3 peripheral ========== */
#define AT91C_US3_RNPR  ((AT91_REG *) 	0xFFFD0110) /* (PDC_US3) Receive Next Pointer Register*/
#define AT91C_US3_RNCR  ((AT91_REG *) 	0xFFFD0114) /* (PDC_US3) Receive Next Counter Register*/
#define AT91C_US3_PTSR  ((AT91_REG *) 	0xFFFD0124) /* (PDC_US3) PDC Transfer Status Register*/
#define AT91C_US3_PTCR  ((AT91_REG *) 	0xFFFD0120) /* (PDC_US3) PDC Transfer Control Register*/
#define AT91C_US3_TCR   ((AT91_REG *) 	0xFFFD010C) /* (PDC_US3) Transmit Counter Register*/
#define AT91C_US3_TNPR  ((AT91_REG *) 	0xFFFD0118) /* (PDC_US3) Transmit Next Pointer Register*/
#define AT91C_US3_RCR   ((AT91_REG *) 	0xFFFD0104) /* (PDC_US3) Receive Counter Register*/
#define AT91C_US3_TPR   ((AT91_REG *) 	0xFFFD0108) /* (PDC_US3) Transmit Pointer Register*/
#define AT91C_US3_TNCR  ((AT91_REG *) 	0xFFFD011C) /* (PDC_US3) Transmit Next Counter Register*/
#define AT91C_US3_RPR   ((AT91_REG *) 	0xFFFD0100) /* (PDC_US3) Receive Pointer Register*/
/* ========== Register definition for US3 peripheral ========== */
#define AT91C_US3_NER   ((AT91_REG *) 	0xFFFD0044) /* (US3) Nb Errors Register*/
#define AT91C_US3_RTOR  ((AT91_REG *) 	0xFFFD0024) /* (US3) Receiver Time-out Register*/
#define AT91C_US3_IDR   ((AT91_REG *) 	0xFFFD000C) /* (US3) Interrupt Disable Register*/
#define AT91C_US3_MR    ((AT91_REG *) 	0xFFFD0004) /* (US3) Mode Register*/
#define AT91C_US3_FIDI  ((AT91_REG *) 	0xFFFD0040) /* (US3) FI_DI_Ratio Register*/
#define AT91C_US3_BRGR  ((AT91_REG *) 	0xFFFD0020) /* (US3) Baud Rate Generator Register*/
#define AT91C_US3_THR   ((AT91_REG *) 	0xFFFD001C) /* (US3) Transmitter Holding Register*/
#define AT91C_US3_CR    ((AT91_REG *) 	0xFFFD0000) /* (US3) Control Register*/
#define AT91C_US3_IF    ((AT91_REG *) 	0xFFFD004C) /* (US3) IRDA_FILTER Register*/
#define AT91C_US3_IER   ((AT91_REG *) 	0xFFFD0008) /* (US3) Interrupt Enable Register*/
#define AT91C_US3_TTGR  ((AT91_REG *) 	0xFFFD0028) /* (US3) Transmitter Time-guard Register*/
#define AT91C_US3_RHR   ((AT91_REG *) 	0xFFFD0018) /* (US3) Receiver Holding Register*/
#define AT91C_US3_IMR   ((AT91_REG *) 	0xFFFD0010) /* (US3) Interrupt Mask Register*/
#define AT91C_US3_CSR   ((AT91_REG *) 	0xFFFD0014) /* (US3) Channel Status Register*/
/* ========== Register definition for PDC_US4 peripheral ========== */
#define AT91C_US4_TNCR  ((AT91_REG *) 	0xFFFD411C) /* (PDC_US4) Transmit Next Counter Register*/
#define AT91C_US4_RPR   ((AT91_REG *) 	0xFFFD4100) /* (PDC_US4) Receive Pointer Register*/
#define AT91C_US4_RNCR  ((AT91_REG *) 	0xFFFD4114) /* (PDC_US4) Receive Next Counter Register*/
#define AT91C_US4_TPR   ((AT91_REG *) 	0xFFFD4108) /* (PDC_US4) Transmit Pointer Register*/
#define AT91C_US4_PTCR  ((AT91_REG *) 	0xFFFD4120) /* (PDC_US4) PDC Transfer Control Register*/
#define AT91C_US4_TCR   ((AT91_REG *) 	0xFFFD410C) /* (PDC_US4) Transmit Counter Register*/
#define AT91C_US4_RCR   ((AT91_REG *) 	0xFFFD4104) /* (PDC_US4) Receive Counter Register*/
#define AT91C_US4_RNPR  ((AT91_REG *) 	0xFFFD4110) /* (PDC_US4) Receive Next Pointer Register*/
#define AT91C_US4_TNPR  ((AT91_REG *) 	0xFFFD4118) /* (PDC_US4) Transmit Next Pointer Register*/
#define AT91C_US4_PTSR  ((AT91_REG *) 	0xFFFD4124) /* (PDC_US4) PDC Transfer Status Register*/
/* ========== Register definition for US4 peripheral ========== */
#define AT91C_US4_BRGR  ((AT91_REG *) 	0xFFFD4020) /* (US4) Baud Rate Generator Register*/
#define AT91C_US4_THR   ((AT91_REG *) 	0xFFFD401C) /* (US4) Transmitter Holding Register*/
#define AT91C_US4_RTOR  ((AT91_REG *) 	0xFFFD4024) /* (US4) Receiver Time-out Register*/
#define AT91C_US4_IMR   ((AT91_REG *) 	0xFFFD4010) /* (US4) Interrupt Mask Register*/
