una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe256.h
/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM9XE256*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Controller*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOC   ((unsigned int)  4) /* Parallel IO Controller C*/
#define AT91C_ID_ADC    ((unsigned int)  5) /* ADC*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int)  8) /* USART 2*/
#define AT91C_ID_MCI    ((unsigned int)  9) /* Multimedia Card Interface 0*/
#define AT91C_ID_UDP    ((unsigned int) 10) /* USB Device Port*/
#define AT91C_ID_TWI0   ((unsigned int) 11) /* Two-Wire Interface 0*/
#define AT91C_ID_SPI0   ((unsigned int) 12) /* Serial Peripheral Interface 0*/
#define AT91C_ID_SPI1   ((unsigned int) 13) /* Serial Peripheral Interface 1*/
#define AT91C_ID_SSC0   ((unsigned int) 14) /* Serial Synchronous Controller 0*/
#define AT91C_ID_TC0    ((unsigned int) 17) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 18) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 19) /* Timer Counter 2*/
#define AT91C_ID_UHP    ((unsigned int) 20) /* USB Host Port*/
#define AT91C_ID_EMAC   ((unsigned int) 21) /* Ethernet Mac*/
#define AT91C_ID_HISI   ((unsigned int) 22) /* Image Sensor Interface*/
#define AT91C_ID_US3    ((unsigned int) 23) /* USART 3*/
#define AT91C_ID_US4    ((unsigned int) 24) /* USART 4*/
#define AT91C_ID_TWI1   ((unsigned int) 25) /* Two-Wire Interface 1*/
#define AT91C_ID_TC3    ((unsigned int) 26) /* Timer Counter 3*/
#define AT91C_ID_TC4    ((unsigned int) 27) /* Timer Counter 4*/
#define AT91C_ID_TC5    ((unsigned int) 28) /* Timer Counter 5*/
#define AT91C_ID_IRQ0   ((unsigned int) 29) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ID_IRQ2   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ2)*/
#define AT91C_ALL_INT   ((unsigned int) 0xFFFE7FFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM9XE256*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFFD00) /* (SYS) Base Address*/
#define AT91C_BASE_EBI       ((AT91PS_EBI) 	0xFFFFEA00) /* (EBI) Base Address*/
#define AT91C_BASE_HECC      ((AT91PS_ECC) 	0xFFFFE800) /* (HECC) Base Address*/
#define AT91C_BASE_SDRAMC    ((AT91PS_SDRAMC) 	0xFFFFEA00) /* (SDRAMC) Base Address*/
#define AT91C_BASE_SMC       ((AT91PS_SMC) 	0xFFFFEC00) /* (SMC) Base Address*/
#define AT91C_BASE_MATRIX    ((AT91PS_MATRIX) 	0xFFFFEE00) /* (MATRIX) Base Address*/
#define AT91C_BASE_CCFG      ((AT91PS_CCFG) 	0xFFFFEF10) /* (CCFG) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOC) Base Address*/
#define AT91C_BASE_EFC       ((AT91PS_EFC) 	0xFFFFFA00) /* (EFC) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_SHDWC     ((AT91PS_SHDWC) 	0xFFFFFD10) /* (SHDWC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TC3       ((AT91PS_TC) 	0xFFFDC000) /* (TC3) Base Address*/
#define AT91C_BASE_TC4       ((AT91PS_TC) 	0xFFFDC040) /* (TC4) Base Address*/
#define AT91C_BASE_TC5       ((AT91PS_TC) 	0xFFFDC080) /* (TC5) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFFA0000) /* (TCB0) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFFDC000) /* (TCB1) Base Address*/
#define AT91C_BASE_PDC_MCI   ((AT91PS_PDC) 	0xFFFA8100) /* (PDC_MCI) Base Address*/
#define AT91C_BASE_MCI       ((AT91PS_MCI) 	0xFFFA8000) /* (MCI) Base Address*/
#define AT91C_BASE_PDC_TWI0  ((AT91PS_PDC) 	0xFFFAC100) /* (PDC_TWI0) Base Address*/
#define AT91C_BASE_TWI0      ((AT91PS_TWI) 	0xFFFAC000) /* (TWI0) Base Address*/
#define AT91C_BASE_PDC_TWI1  ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_TWI1) Base Address*/
#define AT91C_BASE_TWI1      ((AT91PS_TWI) 	0xFFFD8000) /* (TWI1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFB0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFB0000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFB4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFB4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFFB8100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFFB8000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_US3   ((AT91PS_PDC) 	0xFFFD0100) /* (PDC_US3) Base Address*/
#define AT91C_BASE_US3       ((AT91PS_USART) 	0xFFFD0000) /* (US3) Base Address*/
#define AT91C_BASE_PDC_US4   ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_US4) Base Address*/
#define AT91C_BASE_US4       ((AT91PS_USART) 	0xFFFD4000) /* (US4) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFFBC100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFFBC000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFC8100) /* (PDC_SPI0) Base Address*/
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFC8000) /* (SPI0) Base Address*/
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFCC100) /* (PDC_SPI1) Base Address*/
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFCC000) /* (SPI1) Base Address*/
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_ADC) Base Address*/
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFE0000) /* (ADC) Base Address*/
#define AT91C_BASE_EMACB     ((AT91PS_EMAC) 	0xFFFC4000) /* (EMACB) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFA4000) /* (UDP) Base Address*/
#define AT91C_BASE_UHP       ((AT91PS_UHP) 	0x00500000) /* (UHP) Base Address*/
#define AT91C_BASE_HISI      ((AT91PS_ISI) 	0xFFFC0000) /* (HISI) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM9XE256*/
/* ******************************************************************************/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00100000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00008000) /* Internal ROM size in byte (32 Kbytes)*/
/* IRAM*/
#define AT91C_IRAM 	 ((char *) 	0x00300000) /* Maximum IRAM Area : 32Kbyte base address*/
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x00008000) /* Maximum IRAM Area : 32Kbyte size in byte (32 Kbytes)*/
/* IRAM_MIN*/
#define AT91C_IRAM_MIN	 ((char *) 	0x00300000) /* Minimun IRAM Area : 32Kbyte base address*/
#define AT91C_IRAM_MIN_SIZE	 ((unsigned int) 0x00008000) /* Minimun IRAM Area : 32Kbyte size in byte (32 Kbytes)*/
/* IFLASH*/
#define AT91C_IFLASH	 ((char *) 	0x00200000) /* Maximum IFLASH Area : 256Kbyte base address*/
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00040000) /* Maximum IFLASH Area : 256Kbyte size in byte (256 Kbytes)*/
/* EBI_CS0*/
#define AT91C_EBI_CS0	 ((char *) 	0x10000000) /* EBI Chip Select 0 base address*/
#define AT91C_EBI_CS0_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 0 size in byte (262144 Kbytes)*/
/* EBI_CS1*/
#define AT91C_EBI_CS1	 ((char *) 	0x20000000) /* EBI Chip Select 1 base address*/
#define AT91C_EBI_CS1_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_SDRAM*/
#define AT91C_EBI_SDRAM	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_SIZE	 ((unsigned int) 0x10000000) /* SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_SDRAM_16BIT*/
#define AT91C_EBI_SDRAM_16BIT	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)*/
/* EBI_SDRAM_32BIT*/
#define AT91C_EBI_SDRAM_32BIT	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)*/
/* EBI_CS2*/
#define AT91C_EBI_CS2	 ((char *) 	0x30000000) /* EBI Chip Select 2 base address*/
#define AT91C_EBI_CS2_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 2 size in byte (262144 Kbytes)*/
/* EBI_CS3*/
#define AT91C_EBI_CS3	 ((char *) 	0x40000000) /* EBI Chip Select 3 base address*/
#define AT91C_EBI_CS3_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_SM*/
#define AT91C_EBI_SM	 ((char *) 	0x40000000) /* SmartMedia on Chip Select 3 base address*/
#define AT91C_EBI_SM_SIZE	 ((unsigned int) 0x10000000) /* SmartMedia on Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_CS4*/
#define AT91C_EBI_CS4	 ((char *) 	0x50000000) /* EBI Chip Select 4 base address*/
#define AT91C_EBI_CS4_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CF0*/
#define AT91C_EBI_CF0	 ((char *) 	0x50000000) /* CompactFlash 0 on Chip Select 4 base address*/
#define AT91C_EBI_CF0_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 0 on Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CS5*/
#define AT91C_EBI_CS5	 ((char *) 	0x60000000) /* EBI Chip Select 5 base address*/
#define AT91C_EBI_CS5_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI_CF1*/
#define AT91C_EBI_CF1	 ((char *) 	0x60000000) /* CompactFlash 1 on Chip Select 5 base address*/
#define AT91C_EBI_CF1_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 1 on Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI_CS6*/
#define AT91C_EBI_CS6	 ((char *) 	0x70000000) /* EBI Chip Select 6 base address*/
#define AT91C_EBI_CS6_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 6 size in byte (262144 Kbytes)*/
/* EBI_CS7*/
#define AT91C_EBI_CS7	 ((char *) 	0x80000000) /* EBI Chip Select 7 base address*/
#define AT91C_EBI_CS7_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 7 size in byte (262144 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

